Revit 2024 API
ElectricalAnalyticalNode.Create Method
 Creates an electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static ElectricalAnalyticalNode Create(
	Document document,
	ElectricalAnalyticalNodeType type,
	string name
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	type As ElectricalAnalyticalNodeType, _
	name As String _
) As ElectricalAnalyticalNode
Visual C++
public:
static ElectricalAnalyticalNode^ Create(
	Document^ document,
	ElectricalAnalyticalNodeType type,
	String^ name
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document where the new element will be created.
type
Type: Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType
 The type of electrical analytical node to be created.
name
Type: System.String
 The name of new electrical analytical node. The actual name may be post-fixed if already exists.
Return Value
 The newly created electrical analytical node.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace